Documents/ПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеНаРасчетныйСчет</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ВзаиморасчетыСКонтрагентамиПоЗаказДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.БонусыКонтрагентов</xr:Item>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаЗаказовНаПроизводство</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоРассрочкам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЭквайрингу</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.КредитыИЗаймы</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВхНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияБанка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьБонусы</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйУчетБонусовПоДисконтнымКартам</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовПоНачислению</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусовКНачислениюПоДисконтнойКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Оплачено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬЗаказДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОплатаПоЗаказамНаПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬСчетНаОплату</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧекФискализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.КредитныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументНАНБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НастройкаАвтоматическихНачисленийБонусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОсновногоТелаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПроцентовПоЗайму</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬЗаказыНаПроизводство</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежаПоРассрочке</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.Замена</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭквайринговыеОперации</Name>
					<Comment>#6440</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
								<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВозврата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКомиссииВозврата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/МетодыВеденияУчетаДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>МетодыВеденияУчетаДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кассовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Некассовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеНаРасчетныйСчет/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда	
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	Если ВидОперации.Пустая() Тогда
		ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("МассивДокументов") Тогда
			Если ДанныеЗаполнения.МассивДокументов.Количество() > 0 Тогда
				Если ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
					ЗаполнитьПоРеализации(ДанныеЗаполнения.МассивДокументов);
				ИначеЕсли ТипЗнч(ДанныеЗаполнения.МассивДокументов[0]) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
					ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения.МассивДокументов);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		ЗаполнитьПоМонтажу(ДанныеЗаполнения);

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		ЗаполнитьПоРеализации(ДанныеЗаполнения);
		
	//#7080
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ВидОперации 	= Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратОтПоставщика;
		Организация 	= ДанныеЗаполнения.Организация;
		Подразделение 	= ДанныеЗаполнения.Подразделение; // № 12857
		Контрагент 		= ДанныеЗаполнения.Контрагент;
		Договор 		= ДанныеЗаполнения.ДоговорКонтрагента;
		Сумма  			= ДанныеЗаполнения.СуммаДокумента;
		Валюта 			= ДанныеЗаполнения.Валюта;
					
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ДанныеЗаполнения;
		НоваяСтрока.Сумма = ДанныеЗаполнения.СуммаДокумента;
		
		ДобавитьОснование(ДанныеЗаполнения);
		
	КонецЕсли;

	СтатьяДоходов  = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперации);
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, ВидОперации, Ложь);
	СтатьяДоходовПоНачислению = СтатьяДоходов; //#9708
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		КатегорияКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Категория");	
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	РаспределениеПлатежа.Очистить();	
	ЧекФискализирован = Ложь;
	НомерСменыККМ = 0;
	НомерЧекаККМ = 0;
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПолеСтатьяДДСОбязательно = Константы.ОбязательноеЗаполнениеСтатьиВДенежныхДокументах.Получить();	
	Если НЕ ЗначениеЗаполнено(Статья) И ПолеСтатьяДДСОбязательно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         	НСтр("ru = 'Не заполнена статья движения денежных средств!'"), ЭтотОбъект,
        	"Статья",,Отказ);
	КонецЕсли;
		
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратОтПоставщика Тогда 
		ПроверяемыеРеквизиты.Добавить("Контрагент");
		ПроверяемыеРеквизиты.Добавить("Договор"); // №12420 ранее было: ПроверяемыеРеквизиты.Добавить("ДоговорКонтрагента");
	КонецЕсли;
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);
	
	ФинансыСервер.ДокументПриходаПередЗаписью(ЭтотОбъект, Ложь, ВидОперации, Отказ, РежимЗаписи, РежимПроведения);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//#6440
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам 
			И ПолучитьФункциональнуюОпцию("ИспользоватьРаспределениеПоЭквайрингу") Тогда
			
			СуммаРаспределенияКомиссии = ЭквайринговыеОперации.Итог("СуммаКомиссии") - ЭквайринговыеОперации.Итог("СуммаКомиссииВозврата");
			СуммаРаспределения = ЭквайринговыеОперации.Итог("Сумма") - ЭквайринговыеОперации.Итог("СуммаВозврата") - СуммаРаспределенияКомиссии;

			Если СуммаРаспределения <> Сумма Тогда
				ТекстСообщения = НСтр("ru = 'Сумма документа: %СуммаДокумента% %Валюта%, не соответствует сумме разнесенных платежей в табличной части: %СуммаРаспределения% %Валюта%!'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаДокумента%", Строка(Сумма));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаРаспределения%", Строка(СуммаРаспределения));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Валюта%", СокрЛП(Строка(Валюта)));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,"Сумма",,Отказ);
			КонецЕсли;
			
			Если СуммаРаспределенияКомиссии <> КомиссияБанка Тогда
				ТекстСообщения = НСтр("ru = 'Сумма комиссии: %СуммаДокумента% %Валюта%, не соответствует сумме разнесенных платежей в табличной части: %СуммаРаспределенияКомиссии% %Валюта%!'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаДокумента%", Строка(КомиссияБанка));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СуммаРаспределенияКомиссии%", Строка(СуммаРаспределенияКомиссии));
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Валюта%", СокрЛП(Строка(Валюта)));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,"КомиссияБанка",,Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ Счет.Владелец = Организация Тогда
		Сообщить("Счет " + Счет + " не принадлежит организации "+Организация+". Проведение отменено.");
		Отказ = Истина;
	КонецЕсли;
	
	//проверки
	Если НЕ Валюта = Счет.Валюта Тогда
		Сообщить("Валюта банковского счета ("+Счет.Валюта+") и валюта документа ("+Валюта+") различаются. Документ не проведен");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//#3762 реквизит документ убран
	//Если НЕ Оплачено Тогда
	//	Возврат;	
	//КонецЕсли;
	
	// регистр ДенежныеСредства Приход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.СчетКасса = Счет;
	Движение.Валюта = Валюта;
	Движение.Сумма = Сумма;
	
	// регистр ДвиженияДенежныеСредства Приход
	Если ЗначениеЗаполнено(Статья) И ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоСтатьямДДС") Тогда
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СчетКасса = Счет;
		Движение.СуммаПриход = Сумма;
		Движение.Статья = Статья;
		Движение.Валюта = Валюта;
	КонецЕсли;

#Область ОплатаОтПокупателя	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя Тогда
		// регистр ВзаиморасчетыСКонтрагентами Расход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		//Движение.Документ = Ссылка;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;
		
		//Бонусы контрагентов
		Движения.БонусыКонтрагентов.Записывать = Истина;
		Если НачислятьБонусы 
			И ?(СлужебныйУчетБонусовПоДисконтнымКартам, НЕ ДисконтнаяКарта.Пустая(), Истина) // №6316 нужно проверить заполнение дисконтной карты
		Тогда
			Если НЕ СуммаБонусовКНачислениюПоДисконтнойКарте = 0 Тогда
				Движение = Движения.БонусыКонтрагентов.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Контрагент = Контрагент;
				Движение.ДисконтнаяКарта = ДисконтнаяКарта;
				Движение.Сумма = СуммаБонусовКНачислениюПоДисконтнойКарте;
				Движение.ДокументНАНБ = ДокументНАНБ;
				Движение.КатегорияКонтрагента = КатегорияКонтрагента;
			КонецЕсли;
		КонецЕсли;
		//nva+++
		//изменяем статус оплаты распределенных заказов покупателей	
		//НачатьТранзакцию();
		Для Каждого СтрокаРаспределениеПлатежа Из РаспределениеПлатежа Цикл
			Если ТипЗнч(СтрокаРаспределениеПлатежа.Документ) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаказПокупателя = СтрокаРаспределениеПлатежа.Документ;
			
			//Если это оплата по QR коду, то способ платежа в заказе уже должен быть изменен на Qr-код при загрузке из банка
			//проверим это  
			ЭтоОплатаСБП = СтрНайти(Комментарий, "qrcId") > 0;
			Если ЭтоОплатаСБП Тогда
				СпособоОплатыQRКод = Справочники.СпособыОплатыЗаказа.QRкод;
				Если ЗаказПокупателя.СпособОплаты = СпособоОплатыQRКод Тогда
					Продолжить;
				Иначе
					СпособОплатыЗаказа = СпособоОплатыQRКод;
				КонецЕсли;	
			Иначе
				СуммаВЗаказеПокупателя =  ЗаказПокупателя.СуммаДокумента;
				Если СуммаВЗаказеПокупателя < СтрокаРаспределениеПлатежа.Сумма Тогда
					СпособОплатыЗаказа = Справочники.СпособыОплатыЗаказа.ЧастичноОплачен;
				Иначе
					СпособОплатыЗаказа = Справочники.СпособыОплатыЗаказа.РасчетныйСчет;
				КонецЕсли;
			КонецЕсли;	
				
			//Если ОбщийМодульВызовСервера.ПроверкаОбъектЗаблокирован(ЗаказПокупателя).Заблокирован Тогда
			//	Если НЕ ОбменДанными.Загрузка Тогда
			//		Отказ = Истина;
			//	КонецЕсли;
			//	Сообщить("Документ: " + ЗаказПокупателя + " заблокирован другим пользователем!");
			//	Продолжить;
			//КонецЕсли;
			ЗаказПокупателяОбъект = ЗаказПокупателя.ПолучитьОбъект();			
			Если ЗаказПокупателяОбъект.СпособОплаты <> СпособОплатыЗаказа Тогда
				ЗаказПокупателяОбъект.СпособОплаты = СпособОплатыЗаказа;
				ЗаказПокупателяОбъект.Записать();
			КонецЕсли;	
		КонецЦикла;	  
		//Если Отказ Тогда
		//	ОтменитьТранзакцию(); 
		//Иначе	
		//	ЗафиксироватьТранзакцию();
		//КонецЕсли;		
		//nva---
#КонецОбласти		

#Область ПоступлениеПоБанковскимКартам	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам Тогда
		// регистр РасчетыПоЭквайрингу Расход
		Движения.РасчетыПоЭквайрингу.Записывать = Истина;
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРаспределениеПоЭквайрингу") Тогда
			Движение = Движения.РасчетыПоЭквайрингу.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ЭквайринговыйТерминал = ЭквайринговыйТерминал;
			Движение.Сумма = Сумма + КомиссияБанка; // #7342 добавлена КомиссияБанка
			Движение.КомиссияБанка = КомиссияБанка;
		Иначе
			//#6440
			Для каждого СтрокаТЧ из ЭквайринговыеОперации Цикл
				Движение = Движения.РасчетыПоЭквайрингу.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.ЭквайринговыйТерминал = ЭквайринговыйТерминал;
				Движение.Сумма = СтрокаТЧ.Сумма + СтрокаТЧ.СуммаВозврата;
				Движение.КомиссияБанка = СтрокаТЧ.СуммаКомиссии + СтрокаТЧ.СуммаКомиссииВозврата;
				Движение.Документ = СтрокаТЧ.Документ;
				Если ТипЗнч(Движение.Документ) = Тип("ДокументСсылка.ОплатаБанковскойКартой") Тогда
					Движение.ВидОперации = Движение.Документ.ВидОперации;
				ИначеЕсли ТипЗнч(Движение.Документ) = Тип("ДокументСсылка.ЧекККМ") Тогда
					Движение.ВидОперации = ОбщийМодульСервер.ВидОперацииПоЭквайрингуПоВидуОперацииЧека(Движение.Документ.ВидОперации);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
#КонецОбласти		

#Область ВозвратОтПоставщика
	//#7080	
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратОтПоставщика Тогда
		// регистр ВзаиморасчетыСКонтрагентами Расход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		//Движение.Документ = Ссылка;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Валюта = Валюта;
		Движение.Сумма = Сумма;
		
		// регистр РасчетыСКонтрагентами Расход
		Движения.РасчетыСКонтрагентами.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
			Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				Движение = Движения.РасчетыСКонтрагентами.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период 	 = Дата;
				Движение.Заказ 		 = ТекущаяСтрока.Документ;
				Движение.Контрагент  = Контрагент;
				Движение.Организация = Организация;
				Движение.Сумма 		 = ТекущаяСтрока.Сумма;
			КонецЕсли;
		КонецЦикла;
#КонецОбласти		

#Область КредитыИЗаймы
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПолучениеКредита Тогда
		// регистр КредитыИЗаймы Расход
		Движения.КредитыИЗаймы.Записывать = Истина;		
		Движение = Движения.КредитыИЗаймы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент  = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);		
		
		РаспределениеПлатежа.Очистить();
		
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратЗайма Тогда
		// регистр КредитыИЗаймы Расход
		Движения.КредитыИЗаймы.Записывать = Истина;		
		Движение = Движения.КредитыИЗаймы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Контрагент  = Контрагент;
		Движение.Договор = Договор;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаОсновногоТелаЗайма);		
		
		РаспределениеПлатежа.Очистить();
		
#КонецОбласти		

	КонецЕсли;
	
	//регистр ДолгиПоРассрочкам
	Движения.ДолгиПоРассрочкам.Записывать = Истина;
	Для Каждого СтрокаРаспределения Из РаспределениеПлатежа Цикл
		Если ТипЗнч(СтрокаРаспределения.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Если НЕ СтрокаРаспределения.Документ.Пустая() Тогда
				Если НЕ СтрокаРаспределения.ДатаПлатежаПоРассрочке = Дата(1,1,1) Тогда
					Движение = Движения.ДолгиПоРассрочкам.Добавить();
					Движение.Период = Дата;
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.СрокПлатежа = СтрокаРаспределения.ДатаПлатежаПоРассрочке;
					Движение.ЗаказДоговор = СтрокаРаспределения.Документ;
					//#9779
					//Движение.Сумма = СтрокаРаспределения.Сумма;
					Если СтрокаРаспределения.Документ.Валюта = Валюта ИЛИ СтрокаРаспределения.СуммаВВалютеДокумента = 0 Тогда 
						Движение.Сумма = СтрокаРаспределения.Сумма;
					Иначе
						Движение.Сумма = СтрокаРаспределения.СуммаВВалютеДокумента; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Распределение РасчетыПоЗаказам
	СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
	Движения.РасчетыПоЗаказам.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
		НайденныйВидДокумента = СписокВидовДокументовПоКоторымВедутсяРасчеты.Найти(ТипЗнч(ТекущаяСтрока.Документ));
		Если НайденныйВидДокумента <> Неопределено Тогда
			Движение = Движения.РасчетыПоЗаказам.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Заказ = ТекущаяСтрока.Документ;
			Если ТекущаяСтрока.Документ.Валюта = Валюта ИЛИ ТекущаяСтрока.СуммаВВалютеДокумента = 0 Тогда 
				Движение.Сумма = ТекущаяСтрока.Сумма;
			Иначе
				Движение.Сумма = ТекущаяСтрока.СуммаВВалютеДокумента; 
			КонецЕсли;
			Движение.Контрагент = Контрагент; // №6496 добавлен контрагент в измерение
		КонецЕсли;	
	КонецЦикла;
	
	//регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Расход
	Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Записывать = Истина;
	Для Каждого ТекущаяСтрока Из РаспределениеПлатежа Цикл
		Если ТипЗнч(ТекущаяСтрока.Документ) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Заказ = ТекущаяСтрока.Документ;
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
		КонецЕсли;					
	КонецЦикла;

	Если НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ИнкассацияВБанк
		И НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратЗайма
		И НЕ ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПолучениеКредита
		И ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов Тогда
		
		Движения.ДоходыРасходы.Записывать = Истина;						
		Если НЕ СтатьяДоходов.Пустая() И ПараметрыСеанса.ФинРезультатКассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//кассовый метод
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяДоходов;
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
			Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
			Движение.СуммаРасходов 	= 0;
		КонецЕсли;
		
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам 
			И КомиссияБанка <> 0 
			И НЕ СтатьяРасходов.Пустая() Тогда
			
			Если ПараметрыСеанса.ФинРезультатКассовыйМетодВеденияУчетаДоходовРасходов Тогда
				//кассовый метод
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= СтатьяРасходов; //Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы;
				Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, КомиссияБанка);
			КонецЕсли;
			Если ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов Тогда
				//метод отгрузки
				Движение = Движения.ДоходыРасходы.Добавить();
				Движение.Период 		= Дата;
				Движение.Организация 	= Организация;
				Движение.Подразделение 	= Подразделение;
				Движение.Статья 		= СтатьяРасходов; //Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы;
				Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
				Движение.СуммаДоходов 	= 0;
				Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, КомиссияБанка);
			КонецЕсли;
		КонецЕсли;
		
		//#9708
		Если ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПрочееПоступление 
			И НЕ СтатьяДоходовПоНачислению.Пустая() И ПараметрыСеанса.ФинРезультатНекассовыйМетодВеденияУчетаДоходовРасходов Тогда
			//некассовый метод
			Движения.ДоходыРасходы.Записывать = Истина;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяДоходовПоНачислению;
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
			Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Сумма);
			Движение.СуммаРасходов 	= 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратЗайма И ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов И СуммаПроцентовПоЗайму > 0  Тогда
			Движения.ДоходыРасходы.Записывать = Истина;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= Подразделение;
			Движение.Статья 		= СтатьяДоходов;
			Движение.Метод		 	= Перечисления.МетодыВеденияУчетаДоходовРасходов.Кассовый;
			Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаПроцентовПоЗайму);
			Движение.СуммаРасходов 	= 0;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	// №6960 настройки по бонусам делаем только если глобально включен учет бонусов
	Если ПолучитьФункциональнуюОпцию("УчетБонусов") Тогда
		//#13834 изменена настройка
		//НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусыВДокументахОплаты.Получить();
		НачислятьБонусы 						= Константы.АвтоматическиНачислятьБонусы.Получить();
		СлужебныйУчетБонусовПоДисконтнымКартам 	= Константы.УчетБонусовПоДисконтнымКартам.Получить();
	Иначе
		НачислятьБонусы = Ложь;
		СлужебныйУчетБонусовПоДисконтнымКартам = Ложь;
	КонецЕсли;
		
	ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
	СуммаБонусовКНачислениюПоДисконтнойКарте = 0;
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
		СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	
		ФинансыКлиентСервер.ПересчитатьСуммуНДС(ЭтотОбъект, УчитыватьНДС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОснование(ДанныеЗаполнения) Экспорт
	
	НайденныеСтроки = Основания.НайтиСтроки(Новый Структура("Основание", ДанныеЗаполнения));
	Если  НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = Основания.Добавить();
		НоваяСтрока.Основание = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивДокументов);
	
	Контрагент 		= МассивДокументов[0].Контрагент;
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; //#5775 	
	Валюта 			= МассивДокументов[0].Валюта; //#7373
	
	ДобавлятьЗаказыВторогоПорядкаВРаспределение = НЕ Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	ДобавлятьДокументыПродажиПоЗаказам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если ДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
	//#7709 
	//после определения суммы документа
	Если ДобавлятьДокументыПродажиПоЗаказам Тогда
		Для каждого ЭлементМассива из МассивДокументов Цикл
			ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(ЭтотОбъект, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоРеализации(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Контрагент 		= МассивДокументов[0].Контрагент;		
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; // № 12857
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта; //#7373
	
	НеДобавлятьЗаказыВторогоПорядкаВРаспределение = Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ);				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если НЕ НеДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказДоговору(ДанныеЗаполнения, ДатаПлатежаПоРассрочке = '00010101', СуммаПлатежаРассрочки = 0)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
			
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; //#12846
	Контрагент 		= МассивДокументов[0].Контрагент;
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта;
	
	ДобавлятьДокументыПродажиПоЗаказам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
										И Константы.ВестиРасчетыПоЗаказамПоМонтажу.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ);
		Если СуммаПлатежаРассрочки > 0 Тогда
			НоваяСтрока.Сумма = СуммаПлатежаРассрочки;
			НоваяСтрока.ДатаПлатежаПоРассрочке = ДатаПлатежаПоРассрочке;
		КонецЕсли;
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
	
	//#7709 
	//после определения суммы документа
	Если ДобавлятьДокументыПродажиПоЗаказам Тогда
		Для каждого ЭлементМассива из МассивДокументов Цикл
			ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(ЭтотОбъект, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоМонтажу(ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Монтаж") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
			
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; //#12846
	Контрагент 		= МассивДокументов[0].Контрагент;
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Валюта 			= МассивДокументов[0].Валюта;
	
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ЭлементМассива);
		
		НоваяСтрока = РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ);
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
	КонецЦикла;
	
	Сумма = РаспределениеПлатежа.Итог("Сумма");
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
